[
    {
        "heading": "Software and Tech",
        "first": "I graduated Summa Cum Laude with a Bachelor's Degree in Computer Science and a Minor in Business Administration from Biola University in 2021. My education focused on a range of topics, from Back-End programming with Java and C++ to Front-End development using HTML, CSS and Javascript frameworks and to Database management and an exploration of Artificial Intelligence.",
        "second": "Since then, I have been working in a professional capacity at Liferay Inc. developing custom-tailored solutions for a variety of customers. I've used development frameworks ranging from Java and MySQL to React and CSS for full-stack development. I have been responsible for designing both complex Back-End logic and user-friendly Front-End experiences. My work ethic and talent are proven by my promotions from Intern to Associate Engineer to Engineer.",
        "iconSrc": "require(\"../images/icons/software.png\")",
        "iconAlt": "Image of computer with gear in center"
    },
    {
        "heading": "Customer Success",
        "first": "From creating comprehensive documentation covering usage and technical implementation of software solutions to leading meetings to plan features and demo the software, I've always provided tangible ways to enable customers for success.",
        "second": "A primary example of this is when I was brought on a project by leadership to provide direct support to the development team and content creators. By helping the customer understand the software, developing custom resources and templates, and writing documentation to guide their processes, we were able to lead them to achieve their goals.",
        "iconSrc": "require(\"../images/icons/customer.png\")",
        "iconAlt": "Clip art of three individuals in business attire"
    },
    {
        "heading": "Personal Growth",
        "first": "Studying new material and learning new technologies has been a key part of my professional journey. Reading books including, but not limited to, <i>The Pragmatic Programmer</i> by Andy Hunt and Dave Thomas and <i>Clean Code</i> by Robert Martin have improved my programming skills and provided valuable insight into best practices for software development.",
        "second": "Through educational programs such as Udemy and LinkedIn Learning I have studied a wide array of technologies such as Docker, React, Object Oriented Programming, SprintBoot, NGINX, and more.",
        "iconSrc": "require(\"../images/icons/personalGrowth.png\")",
        "iconAlt": "Bar graph with stick figure walking up bars"
    }
]